/*
	Общий список карт 
	
	Карты для двух расс:
	
	- хуггеры (NPC инопланетяни)
	- люди
	
	
	
	
	
*/

var gCards = {
	types: ['model','bully'],
	
	//игроки
	avatars: {
		'model' : [
			{
				id: 1,
				name: 'Данита Энджел', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2
			},
			{
				id: 2,
				name: 'Ана Паула Араужо', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 3,
				name: 'Хелена Кристенсен', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 4,
				name: 'Софи Даль', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 5,
				name: 'Синтия Дикер', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 6,
				name: 'Джордан Данн', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 7,
				name: 'Изабель Гулар', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 8,
				name: 'Джессика Харт', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 9,
				name: 'Хайди Клум', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			},
			{
				id: 10,
				name: 'Адриана Лима', //имя
				type: 'model', //тип карты 
				desc: 'Секси красавица и умница', //краткое описание
				health: 100,
				strike: 10,
				block: 2,
				flee: 2			
			}
		],
		'bully':[
			{
				id: 1,
				name: 'Вано Иван', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 1			
			},
			{
				id: 2,
				name: 'Толян Талюха', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 3,
				name: 'Вася Кирпич', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 4,
				name: 'Студент Игорь', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 5,
				name: 'Сопливый Хрунь', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 6,
				name: 'Вовка-пенсионер', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 7,
				name: 'Рыжий Иван', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 8,
				name: 'Доцент', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 9,
				name: 'Херсонец', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			},
			{
				id: 10,
				name: 'Колька - пляжник', //имя
				type: 'bully', //тип карты 
				desc: 'Чоткий и дерзкий пацанчик', //краткое описание
				health: 100,
				strike: 14,
				block: 4,
				flee: 2			
			}
		]
	},
	
	//приемы (универсальные для всех сторон)
	//список из тхеквондо http://www.paratkd.ru/otkd_korean_term.html
	combats: {
		'stance':[
			{
				id: 1,
				name: 'Дзенкуцу дачи',
				desc: 'Стойка нападения',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 2,
				name: 'Киба дачи',
				desc: 'Стойка "всадника"',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 3,
				name: 'Кокуцу дачи',
				desc: 'Стойка защитная',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 4,
				name: 'Санчин дачи',
				desc: 'Стойка "песочные часы"',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 5,
				name: 'Учи хачиджи дачи',
				desc: 'Стойка, стопы повернуты вовнутрь',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 6,
				name: 'Фудо дачи',
				desc: 'Стойка',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 7,
				name: 'Хейко дачи',
				desc: 'Стойка параллельная',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 8,
				name: 'Хейсоку дачи',
				desc: 'Стойка закрытая',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 9,
				name: 'Цуруаши дачи',
				desc: 'Стойка "цапля"',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 10,
				name: 'Йой дачи',
				desc: 'Стойка готовности',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 11,
				name: 'Какеа-дачи',
				desc: 'Стойка скрещенная',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 12,
				name: 'Мусуби дачи',
				desc: 'Стойка для медитации',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 13,
				name: 'Камайтэ дачи',
				desc: 'Стойка боевая',
				type: 'stance', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 0, //сида удара
				block: 1, //сколько блокирует
				price: 1 //стоимость в поинтах
			}
		],
		'block': [
			//блоки 
			{
				id: 14,
				name: 'Дзёдан укэ',
				desc: 'защита головы',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 15,
				name: 'Сото укэ',
				desc: 'защита корпуса с наружи во внутрь',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 16,
				name: 'Учи укэ',
				desc: 'защита корпуса изнутри наружу',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 17,
				name: 'Гедан барай',
				desc: 'защита корпуса от прямых ногами',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 18,
				name: 'Маваши укэ',
				desc: 'круговой блок',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 19,
				name: 'Шуто маваши укэ',
				desc: 'блок с атакой в ключицу',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 102,
				name: 'ПХАЛЬМОК-ОЛЬГУЛЬ-МАККИ',
				desc: 'верхний блок предплечьем',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 103,
				name: 'АН-ПХАЛЬМОК-ОЛЬГУЛЬ-ГОДОРО-МАККИ',
				desc: 'верхний блок внутренней частью предплечья с поддержкой',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 104,
				name: 'АН-ПХАЛЬМОК-МОМТОН-ГОДОРО-МАККИ',
				desc: 'средний блок внутренней частью предплечья с поддержкой',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 105,
				name: 'БАККАТ-ПХАЛЬМОК-ОЛЬГУЛЬ-БАККАТ-МАККИ',
				desc: 'верхний блок внешней частью предплечья наружу',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 106,
				name: 'АН-ПХАЛЬМОК-ДУРО-ОЛЛИГИ',
				desc: 'блок подъёмом вверх (подхват) внутренней частью предплечья',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 107,
				name: 'ПХАЛЬМОК-АРЭ-МАККИ',
				desc: 'нижний блок предплечьем',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 108,
				name: 'ПХАЛЬМОК-АРЭ-ГОДОРО-МАККИ',
				desc: 'нижний блок предплечьем с поддержкой',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 109,
				name: 'БАТАНСОН-НУЛЛО-МАККИ',
				desc: 'блок прижимом ладонью вниз',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 110,
				name: 'ХАН-СОННАЛЬ-МОМТОН-АН-МАККИ',
				desc: 'средний блок ребром ладони внутрь',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 111,
				name: 'СОННАЛЬ-МОМТОН-МАККИ',
				desc: 'средний блок ребром ладони, усиленный',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 112,
				name: 'АН-ПХАЛЬМОК-МОМТОН-БАККАТ-МАККИ',
				desc: 'средний блок внутренней частью предплечья наружу',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 113,
				name: 'СОННАЛЬ-АРЭ-МАККИ',
				desc: 'нижний блок ребром ладони, усиленный',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 114,
				name: 'БАТАНСОН-МОМТОН-МАККИ',
				desc: 'средний блок ладонью',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 115,
				name: 'СОННАЛЬ-ДЫНГ-МОМТОН-МАККИ',
				desc: 'средний блок ребром ладони со стороны большого пальца',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 116,
				name: 'ПХАЛЬМОК-ОТГОРО-ОЛЬГУЛЬ-МАККИ',
				desc: 'верхний крестообразный блок предплечьями',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 117,
				name: 'СОННАЛЬ-КЫМГАН-МАККИ',
				desc: 'алмазный блок ребром ладоней',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 118,
				name: 'СОННАЛЬ-ОТГОРО-ОЛЬГУЛЬ-МАККИ',
				desc: 'верхний крестообразный блок ребром ладоней',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 119,
				name: 'СОННАЛЬ-ДЫНГ-ОСАНТУЛЬ-МАККИ',
				desc: 'блок на две стороны ребром ладоней',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 120,
				name: 'СОННАЛЬ-АРЭ-ХЭЧО-МАККИ',
				desc: 'нижний блок клином ребром ладоней',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 121,
				name: 'СОННАЛЬ-ДЫНГ-МОМТОН-ХЭЧО-МАККИ',
				desc: 'средний блок клином ребром ладоней со стороны большого пальца',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 122,
				name: 'ХВАНСО-МАККИ',
				desc: 'блок коровьи рога',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 123,
				name: 'ПХАЛЬМОК-КЫМГАН-МАККИ',
				desc: 'алмазный блок предплечьями',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 124,
				name: 'КАВИ-МАККИ',
				desc: 'блок ножницы',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 125,
				name: 'АН-ПХАЛЬМОК-МОМТОН-ХЭЧО-МАККИ',
				desc: 'средний блок клино внутренней частью предплечий',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 126,
				name: 'ПХАЛЬМОК-ОТГОРО-АРЭ-МАККИ',
				desc: 'нижний крестообразный блок предплечьями',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 5 //стоимость в поинтах
			},
			{
				id: 127,
				name: 'ПХАЛЬМОК-АРЭ-ХЭЧО-МАККИ',
				desc: 'нижний блок клином',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 128,
				name: 'СОННАЛЬ-МОМТОН-ХЭЧО-МАККИ',
				desc: 'средний блок клином ребром ладоней',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 1 //стоимость в поинтах
			},
			{
				id: 129,
				name: 'СОННАЛЬ-ОТГОРО-АРЭ-МАККИ',
				desc: 'нижний крестообразный блок ребром ладоней',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 130,
				name: 'ПХАЛЬМОК-КЫМГАН-МОМТОН-МАККИ',
				desc: 'средний алмазный блок',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 131,
				name: 'ПХАЛЬМОК-ОСАНТУЛЬ-МАККИ',
				desc: 'блок на две стороны предплечьями',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 4, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 132,
				name: 'БАККАТ-ПХАЛЬМОК-МОМТОН-ХЭЧО-МАККИ',
				desc: 'средний блок клином внешней частью предплечий',
				type: 'block', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 1, //сида удара
				block: 5, //сколько блокирует
				price: 3 //стоимость в поинтах
			}
		],
		//удары 
		'strike' : [
			{
				id: 20,
				name: 'Прямой удар Цуки',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 21,
				name: 'Гяку Цуки',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 22,
				name: 'Кизами Цуки',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 23,
				name: 'Уракен-Учи',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 24,
				name: 'Шуто-Учи',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 25,
				name: 'Йоко-емпи-учи',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 26,
				name: 'Удар открытой кистью',
				desc: 'Удар рукой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 27,
				name: 'Маэ гэри кэкоми',
				desc: 'проникающий удар ногой вперед',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 28,
				name: 'Йодан маваши гэри',
				desc: 'круговой удар ногой по верхнему уровню',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 29,
				name: 'Йоко Гери',
				desc: 'прямой удар в сторону',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 30,
				name: 'Йоко Гери Кекоми',
				desc: 'проникающий удар',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 31,
				name: 'Йоко Гери Кеаге',
				desc: 'резкий "хлыстообразный" удар',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 32,
				name: 'Йоко Тоби Гери',
				desc: 'удар ногой в сторону в прыжке',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 33,
				name: 'Хиза Гери',
				desc: 'удар коленом',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			{
				id: 34,
				name: 'Ура Маваши Гери',
				desc: 'удар по дуге снаружи-внутрь-назад',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'karate', //из какого боевого искусства прием (на будущее)
				
				strike: 6, //сида удара
				block: 1, //сколько блокирует
				price: 4 //стоимость в поинтах
			},
			//кунг-фу
			{
				id: 35,
				name: 'Черный тигр вырывает сердце',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 36,
				name: 'Одинокий тигр появляется из пещеры',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 37,
				name: 'Ядовитая змея выбрасывает яд',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 38,
				name: 'Красавица смотрится в зеркало',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 39,
				name: 'Драгоценная утка проплывает сквозь лотос',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 40,
				name: 'Мах рукой из стойки "обманной ноги"',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 41,
				name: 'Золотая звезда в углу',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 42,
				name: 'Бессмертный появляется из пещеры',
				desc: 'Прием шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 5, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 43,
				name: 'Прямой удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 44,
				name: 'Пушечный удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 45,
				name: 'Удар "рогом"',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 46,
				name: 'Диагональный удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 47,
				name: 'Сметающий удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 48,
				name: 'Удар "кнутом"',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 49,
				name: 'Волнообразный удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 50,
				name: 'Рубящий удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 51,
				name: 'Вешающий удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 52,
				name: 'Погружающий удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 53,
				name: 'Подмышечный удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			{
				id: 54,
				name: 'Бросающий удар',
				desc: 'Удар шаольнского кунг-фу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'kungfu', //из какого боевого искусства прием (на будущее)
				
				strike: 4, //сида удара
				block: 1, //сколько блокирует
				price: 2 //стоимость в поинтах
			},
			//тхеквон до 
			{
				id: 55,
				name: 'ДЖУМОК-ЧИРИГИ',
				desc: 'прямой удар кулаком вперёд',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 56,
				name: 'ХАН-БОН-ДЖУМОК-ЧИРИГИ',
				desc: 'одиночный удар кулаком',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 57,
				name: 'ДУ-БОН-ДЖУМОК-ЧИРИГИ',
				desc: 'два поочерёдно наносимых удара кулаками',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 58,
				name: 'СЭ-БОН-ДЖУМОК-ЧИРИГИ',
				desc: 'три поочерёдно наносимых удара кулаками',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 59,
				name: 'ДУ-ДЖУМОК-ЧИРИГИ',
				desc: 'удар двумя кулаками одновременно',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 60,
				name: 'ДЖУМОК-БАРО-ЧИРИГИ',
				desc: 'удар кулаком, разноимённый выдвинутой вперёд ноге',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 61,
				name: 'ДЖУМОК-БАНДЭ-ЧИРИГИ',
				desc: 'удар кулаком, одноимённый выдвинутой вперёд ноге',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 62,
				name: 'ДЖУМОК-ЙОП- ЧИРИГИ',
				desc: 'удар кулаком в сторону',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 63,
				name: 'ДЖУМОК-СЭВО-ЧИРИГИ',
				desc: 'удар вертикальным кулаком',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 64,
				name: 'ДЖУМОК-ДЖЭЧЭ-ЧИРИГИ',
				desc: 'удар перевёрнутым кулаком',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 65,
				name: 'ДЖУМОК-ДОЛЬО-ЧИРИГИ',
				desc: 'удар кулаком по кругу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 66,
				name: 'ПЬОН-ДЖУМОК-ЧИРИГИ',
				desc: 'удар полузакрытым кулаком (фалангами пальцев)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 67,
				name: 'БАМ-ДЖУМОК-ЧИРИГИ',
				desc: 'удар кулаком с выставленной фалангой среднего пальца (кулак в форме каштана)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 68,
				name: 'КУН-ДОЛЬ-ЧОГИ',
				desc: 'удар кулаком по малой окружности',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 69,
				name: 'ДЫНГ-ДЖУМОК-АПЕ-ЧИГИ',
				desc: 'удар тыльной стороной кулака вперёд',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 70,
				name: 'ДЫНГ-ДЖУМОК-ПАККАТ-ЧИГИ',
				desc: 'удар тыльной стороной кулака в сторону',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 71,
				name: 'МЭ-ДЖУМОК-ЧИГИ',
				desc: 'удар основанием кулака',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 72,
				name: 'ПЬОН-СОНКЫТ-СЭВО-ЧИРУГИ',
				desc: 'удар кончиками пальце (вертикально поставленной ладони)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 73,
				name: 'ПЬОН-СОНКЫТ-ОПО-ЧИРУГИ',
				desc: 'удар кончиками пальцев (ладонью вниз)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 74,
				name: 'ПЬОН-СОН-КЫТ-ДЖЭЧЭ-ЧИРУГИ',
				desc: 'удар кончиками пальцев (ладонью вверх)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 75,
				name: 'СОННАЛЬ-АН-ЧИГИ',
				desc: 'удар ребром ладони внутрь',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 76,
				name: 'СОННАЛЬ-БАККАТ-ЧИГИ',
				desc: 'удар ребром ладони наружу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 77,
				name: 'СОННАЛЬ-ДЫНГ-АН-ЧИГИ',
				desc: 'удар ребром ладони со стороны большого пальца внутрь',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 78,
				name: 'СОННАЛЬ-ТЫНГ-ПАККАТ-ЧИГИ',
				desc: 'удар ребром ладони со стороны большого пальца наружу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 79,
				name: 'ГАВИ-СОНКЫТ-ЧИРУГИ',
				desc: 'удар двумя пальцами (указательный и средний)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 80,
				name: 'АГИСОН-ЧИГИ',
				desc: 'удар ухватом "вилкой" (ухват образуют большой и указательный палец)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 81,
				name: 'ХАН-СОНКЫТ-ЧИРУГИ',
				desc: 'удар одним пальцем (указательным)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 82,
				name: 'СОНКЫТ-ЧОГИ',
				desc: 'удар кончиками пальцев (образующих щепоть)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 83,
				name: 'АТАНСОН-ЧИГИ',
				desc: 'удар основанием ладони',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 84,
				name: 'ПХАЛЬКУП-ЧИГИ',
				desc: 'удар локтём',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 85,
				name: 'ПХАЛЬКУП-ОЛЬО-ЧИГИ',
				desc: 'удар локтём вверх',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 86,
				name: 'ПХАЛЬКУП-ДЛЛЬЁ-ЧИГИ',
				desc: 'удар локтём по кругу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 87,
				name: 'ПХАЛЬКУП-ЙОП-ЧИГИ',
				desc: 'удар локтём в сторону',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 88,
				name: 'ПХАЛЬКУП-ДИТ-ЧИГИ',
				desc: 'удар локтём назад',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 89,
				name: 'МОНГЭ-ЧИГИ',
				desc: 'удушающий удар (выполняется сразу обеими локтями)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 90,
				name: 'ПХАЛЬМОК-ЧИГИ',
				desc: 'удар предплечьем',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 91,
				name: 'ПХАЛЬМОК-БАККАТ-ЧИГИ',
				desc: 'удар предплечьем наружу',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 92,
				name: 'ПХАЛЬМОК-АН-ЧИГИ',
				desc: 'удар предплечьем внутрь',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 93,
				name: 'АП-ПАЛЬ-ЧАГИ',
				desc: 'удар впереди стоящей ногой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 94,
				name: 'ДВИ-ПАЛЬ-ЧАГИ',
				desc: 'удар сзади стоящей ногой',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 95,
				name: 'ДВИ-КУМЧИ-ЧАГИ',
				desc: 'удар пяткой со стороны ахиллово сухожилия',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 96,
				name: 'ДУБАЛЬ-ДАН-САН-ЧАГИ',
				desc: 'двойной удар ногами в прыжке (удары наносятся по очерёдно)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 97,
				name: 'ТИРО-ТОРА-ЧАГИ',
				desc: 'удар с поворотом через спину',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 98,
				name: 'КАВИ-ЧАГИ',
				desc: 'удар ногами в форме ножниц (горизонтально)',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 99,
				name: 'ТЬО-ДИРО-ДОРА-ЧАГИ',
				desc: 'удар ногой в прыжке с разворотом через спину',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 100,
				name: 'ТЬО-АП-ДОРА-ЧАГИ',
				desc: 'удар ногой в прыжке с разворотом вперёд',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			},
			{
				id: 101,
				name: 'САМ-БОН-ЯН-ЧАГИ',
				desc: 'прыжковая атака по трём направлениям',
				type: 'strike', //стойка [stance], удар [strike], блок [block], прыжок [jump]
				art: 'taekwondo', //из какого боевого искусства прием (на будущее)
				
				strike: 3, //сида удара
				block: 1, //сколько блокирует
				price: 3 //стоимость в поинтах
			}
		]
	},

/*
Появление дракона и тигра».
2.	«Одинокий дракон выныривает из моря» (справа).
3.	«Одинокий дракон выныривает из моря» (слева).
4.	«Плавающий дракон играет в воде» (справа).
5.	«Плавающий дракон играет в воде» (слева).
6.	«Зеленый дракон разбрасывает жемчуг».
7.	«Ядовитая змея греется во мгле».
8.	«Ядовитая змея выбрасывает яд» (слева).
9.	«Ядовитая змея выбрасывает яд» (справа).
10.	«Одинокий тигр появляется из пещеры».
11.	«Черный тигр вырывает сердце».
12.	«Голодный тигр ловит козу».
13.	«Злой леопард вскакивает на скалу».
14.	«Золотой леопард несется сквозь джунгли» (слева).
15.	«Золотой леопард несется сквозь джунгли» (справа).
16.	«Воскресший журавль» (слева).
17.	«Воскресший журавль» (справа).
18.	«Журавль становится между петушками».
19.	«Ки дракона пересекает реку» (слева).
20.	«Ки дракона пересекает реку» (справа). 
21.	«Разъяренный дракон несется сквозь поток».
22.	«Черный тигр несется через долину».
23.	«Разъяренный тигр пригибается к земле».
24.	«Призрачный дракон поднимается к небесам».
25.	«Двойные драконы играют с жемчугом».
26.	«Белый тигр показывает лапу».
27.	«Разъяренный тигр взбирается на гору».
28.	«Золотой леопард смотрит на огонь».
29.	«Журавль пьет из ручья».
30.	«Черный тигр показывает лапу».
31.	«Старый дракон заходит в воду».
32.	«Белая змея переползает через долину».
33.	«Ядовитая змея жалит в жизненно важную точку».
34.	«Золотой леопард проносится сквозь лотос».
35.	«Стабилизация Космоса и Один палец дзен».
36.	«Сосредоточение ки в областях дань тьянь».


АП-ЧАГИ - удар ногой вперёд; 
МИРО-ЧАГИ - толчок всей стопой; 
ЧИКО-ЧАГИ - удар ногой сверху вниз, короткий, всей стопой; 
НЭРЬЁ-ЧАГИ - удар ногой сверху вниз; 
НЭРЬЁ-АН-ЧАГИ - удар ногой сверху вниз снаружи внутрь; 
НЭРЬЁ-БАККАТ-ЧАГИ - удар ногой сверху вниз изнутри наружу; 
ДОЛЬО-ЧАГИ - удар ногой по окружности внутрь; 
АП-ДОЛЬО-ЧАГИ - удар ногой по окружности вперёд и вверх, без заноса колена за ось атаки; 
ПИТ-ЧАГИ - удар ногой под углом 45 внутрь; 
БАНДАЛЬ-ЧАГИ - удар ногой по малой окружности внутрь с заносом колена за ось атаки; 
БИТУРО-ЧАГИ - удар ногой по малой окружности наружу; 
ТИТ-ЧАГИ - удар ногой назад; 
СЭВО-АН-ЧАГИ - вертикальный удар ногой снаружи внутрь; 
СЭВО-ПАККАТ-ЧАГИ - вертикальный удар ногой изнутри наружу; 
БАНДЭ-ЧАГИ - удар прямой ногой; 
ФУРИО-ЧАГИ - рвущий удар ногой; 
НАКО-ЧАГИ - удар ногой в форме крючка; 
СУРО-ЧАГИ - удар зацепом (подсечка); 
НУЛЛО-ПАККАТ-ЧАГИ - внешний удар прижим (среднее между йоп-чаги и миро-чаги, пятка ударной ноги направлена наружу); 
НУЛЛО-АН-ЧАГИ - внутренний удар прижимом (пятка ударной ноги направлена внутрь); 
МУРЫП-ЧИГИ - удар коленом; 
ПАЛЬ-ОЛЛИГИ - прямой мах ногой;
ДАРИ-ФУРИГИ - мах ногой по кругу. 

составляющие

АН-ЧАГИ - удар ногой внутрь; 
БАККАТ-ЧАГИ - удар ногой наружу; (буква Б произносится мягко, между П и Б) 
АП-ЧУК-ЧАГИ - удар подушечками пальцев; 
ДВИ-ЧУК-ЧАГИ - удар пяткой; ( буква Д мягко, между Т и Д) 
БАЛЬ-ПАДАК-ЧАГИ - удар всей стопой; ( Буква Б произносится мягко, почти как П) 
БАЛЬ-НАЛЬ-ЧАГИ - удар ребром стопы; ( буква Б мягко, почти как П) 
БАЛЬ-ДЫНГ-ЧАГИ - удар подъёмом стопы; (буква Б произносится мягко, почти как П) 
ТЬО-ЧАГИ - удар ногой в прыжке; 
МОМДОЛЬО-ЧАГИ - удар ногой с разворотом корпуса; 
МО-ДУБАЛЬ-ЧАГИ - двойной удар ногами в прыжке (удары наносятся одновременно); ( буквы Д и Б мягко, см. предыдущее) 
ТЬО-МОМДОЛЬО-ЧАГИ - удар ногой в прыжке с поворотом корпуса; 
КУЛО-ЧАГИ - обманный удар (финт); 
НОПИ-ЧАГИ - удар ногами в форме ножниц (вертикально); 
КЮО-ДУ-ЧАГИ - изменение ударов ногой без постановки ноги на стопу; 
ЧАПКО-ЧАГИ - удар ногой с одновременным захватом рукой; 
САМ-БОН-ЯН-ЧАГИ - ; 
КОН-ЧУН-ЙОН-СОК-ЧАГИ - прыжковая атака с нанесением трёх последовательных ударов вперёд; 
ИЛЬ-ЧА-ЧАГИ - удар сформированный в одну линию.

Защита (блоки) в тхэквондо

одной рукой 

ПХАЛЬМОК-ОЛЬГУЛЬ-МАККИ - верхний блок предплечьем; 
БАККАТ-ПХАЛЬМОК-ОЛЬГУЛЬ-БАККАТ-МАККИ - верхний блок внешней частью предплечья наружу; 
АН-ПХАЛЬМОК-ОЛЬГУЛЬ-ГОДОРО-МАККИ - верхний блок внутренней частью предплечья с поддержкой; 
АН-ПХАЛЬМОК-МОМТОН-БАККАТ-МАККИ - средний блок внутренней частью предплечья наружу; 
АН-ПХАЛЬМОК-МОМТОН-ГОДОРО-МАККИ - средний блок внутренней частью предплечья с поддержкой; 
АН-ПХАЛЬМОК-МОМТОН-БАТАНСОН-ГОДОРО- МАККИ - средний блок внутренней частью предплечья с поддержкой ладонью; 
АН-ПХАЛЬМОК-ДУРО-ОЛЛИГИ - блок подъёмом вверх (подхват) внутренней частью предплечья; 
БАККАТ-ПХАЛЬМОК-МОМТОН-АН-МАККИ - средний блок внешней частью предплечья внутрь; 
БАККАТ-ПХАЛЬМОК-МОМТОН-БАККАТ-МАККИ - средний блок внешней частью предплечья наружу; 
БАККАТ-ПХАЛЬМОК-МОМТОН-ГОДОРО-МАККИ - средний блок внешней частью предплечья наружу с поддержкой; 
ПХАЛЬМОК-АРЭ-МАККИ - нижний блок предплечьем; 
ПХАЛЬМОК-АРЭ-ГОДОРО-МАККИ - нижний блок предплечьем с поддержкой; 
ХАН-СОННАЛЬ-ОЛЬГУЛЬ-МАККИ - верхний блок ребром ладони; 
ХАН-СОННАЛЬ-ОЛЬГУЛЬ-БАККАТ-МАККИ - верхний блок ребром ладони наружу; 
СОННАЛЬ-ОЛЬГУЛЬ-МАККИ - верхний блок ребром ладони, усиленный; 
ХАН-СОННАЛЬ-МОМТОН-БАККАТ-МАККИ - средний блок ребром ладони наружу; 
ХАН-СОННАЛЬ-МОМТОН-АН-МАККИ - средний блок ребром ладони внутрь; 
СОННАЛЬ-МОМТОН-МАККИ - средний блок ребром ладони, усиленный; 
СОННАЛЬ-ДЫНГ-МОМТОН-МАККИ - средний блок ребром ладони со стороны большого пальца; 
ХАН-СОННАЛЬ-АРЭ-МАККИ - нижний блок ребром ладони; 
СОННАЛЬ-АРЭ-МАККИ - нижний блок ребром ладони, усиленный; 
БАТАНСОН-МОМТОН-МАККИ - средний блок ладонью; (буква Б мягко, почти как П) 
БАТАНСОН-НУЛЛО-МАККИ - блок прижимом ладонью вниз (сбив). (буква Б мягко, почти как П) 

двумя руками одновременно

ПХАЛЬМОК-ОТГОРО-ОЛЬГУЛЬ-МАККИ - верхний крестообразный блок предплечьями; 
ХВАНСО-МАККИ - блок коровьи рога (2 ПХАЛЬМОК-ОЛЬГУЛЬ-МАККИ); 
САНТУЛЬ-МАККИ - блок гора (АН- ПХАЛЬМОК-ОЛЬГУЛЬ-БАККАТ -МАККИ+ БАККАТ-ПХАЛЬМОК-ОЛЬГУЛЬ-АН-МАККИ, руки в одной плоскости с туловищем); 
ХЭЧО-САНТУЛЬ-МАККИ - блок гора (2 АН-ПХАЛЬМОК-ОЛЬГУЛЬ- БАККАТ-МАККИ, руки в одной плоскости с туловищем); 
ПХАЛЬМОК-КЫМГАН-МАККИ - алмазный блок предплечьями (ПХАЛЬМОК-ОЛЬГУЛЬ-МАККИ+ ПХАЛЬМОК-АРЭ-МАККИ); 
ПХАЛЬМОК-КЫМГАН-МОМТОН-МАККИ - средний алмазный блок (ПХАЛЬМОК-ОЛЬГУЛЬ-МАККИ+ АН-ПХАЛЬМОК-МОМТОН-БАККАТ-МАККИ); 
ПХАЛЬМОК-ОСАНТУЛЬ-МАККИ - блок на две стороны предплечьями (ПХАЛЬМОК-АРЭ-МАККИ+АН-ПХАЛЬМОК-ОЛЬГУЛЬ-БАККАТ-МАККИ руки в одной плоскости с туловищем); 
БАККАТ-ПХАЛЬМОК-МОМТОН-ХЭЧО-МАККИ - средний блок клином внешней частью предплечий (2 БАККАТ-ПХАЛЬМОК-МОМТОН-МАККИ); 
АН-ПХАЛЬМОК-МОМТОН-ХЭЧО-МАККИ - средний блок клино внутренней частью предплечий (2 АН-ПХАЛЬМОК-МОМТОН-БАККАТ-МАККИ); 
КАВИ-МАККИ - блок ножницы (АН-НХАЛЬМОК-МОМТОН-БАККАТ-МАККИ+ ПХАЛЬМОК-АРЭ-МАККИ); 
ПХАЛЬМОК-ОТГОРО-АРЭ-МАККИ - нижний крестообразный блок предплечьями; 
ПХАЛЬМОК-АРЭ-ХЭЧО-МАККИ - нижний блок клином (2 ПХАЛЬМОК- АРЭ-МАККИ); 
СОННАЛЬ-КЫМГАН-МАККИ - алмазный блок ребром ладоней (СОННАЛЬ- ОЛЬГУЛЬ-МАККИ+СОННАЛЬ-АРЭ-МАККИ); 
СОННАЛЬ-ОТГОРО-ОЛЬГУЛЬ-МАККИ - верхний крестообразный блок ребром ладоней; 
СОННАЛЬ-ДЫНГ-ОСАНТУЛЬ-МАККИ - блок на две стороны ребром ладоней (СОННАЛЬ-АРЭ-МАККИ+ СОННАЛЬ-ДЫНГ-ОЛЬГУЛЬ-МАККИ руки в одной плоскости с туловищем); 
СОННАЛЬ-МОМТОН-ХЭЧО-МАККИ - средний блок клином ребром ладоней (2 СОННАЛЬ-МОМТОН-БАККАТ-МАККИ); 
СОННАЛЬ-ДЫНГ-МОМТОН-ХЭЧО-МАККИ -средний блок клином ребром ладоней со стороны большого пальца; 
СОННАЛЬ-АРЭ-ХЭЧО-МАККИ - нижний блок клином ребром ладоней (2 СОННАЛЬ-АРЭ-МАККИ); 
СОННАЛЬ-ОТГОРО-АРЭ-МАККИ - нижний крестообразный блок ребром ладоней.
*/

	//выбирает рандомного аватара
	getAvatars: function(type){
		var _id = null;
			_id = gUtils.array_rand(gCards.avatars[ type ], 1);			
			
		if (_id != null)
			return _.clone(gCards.avatars[ type ][ _id ]);
		else
			return true;	
	},
	
	//шаблон дефолной деки - каких сколько карт 
	_defaultDeka:{
		stance: 5,
		block: 6,
		strike: 8
	},
	
	//согласно шаблону возвращает набор карт
	getDeka: function(dekaTpl){
		if ((typeof(dekaTpl) == 'undefined') || (dekaTpl == null))
			dekaTpl = gCards._defaultDeka;
		
		

		
		var _deka = []; //массив карт в деке 
		
		_.each(dekaTpl, function(i, ct){
			
			//_log( ct );
			//_log( gCards.combats[ ct ] );
			//_log( dekaTpl[ ct ] );
			//return;
			
			var tmp = gUtils.array_rand(gCards.combats[ ct ], dekaTpl[ ct ]); //получаем ид
			
			_.each(tmp, function(ci){
				_deka.push( _.clone(gCards.combats[ ct ][ ci ]) );
			});
		});
		
		return _deka;	
	},
	
	renderDeka: function(deka, el){
	
	
	}





}